---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.EditingRequests
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.EditingRequests

Displays a list of other users' requests to borrow elements in your worksets, and your pending requests.